# MaxSize Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
WireType..::..MaxSize Property
WireType Class See Also
---
The max size of the wire type.
**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public WireSize MaxSize { get; set; }
```

Visual Basic
---
```text
Public Property MaxSize As WireSize
	Get
	Set
```

Visual C++
---
```text
public:
property WireSize^ MaxSize {
	WireSize^ get ();
	void set (WireSize^ value);
}
```

# See Also
WireType Class
Autodesk.Revit.DB.Electrical Namespace